'''
Измените знак каждого элемента списка на противоположный:
'''
# list1 = [1, 2, 3, 4, 5]  # [-1, -2, -3, -4, -5]
# list2 = [1, -2, 3, -4, 5]  # [-1, 2, -3, 4, -5]
# list3 = []  # []
#
# print([-i for i in list1])
# print([-i for i in list2])
# print([-i for i in list3])

'''
Дан массив целых чисел. На основе данного массива получите массив, где первый элемент — это количество положительных чисел, а второй элемент — сумма отрицательных чисел.
'''
# list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, -11, -12, -13, -14, -15]  # [10, -65]
# list2 = [0, 2, 3, 0, 5, 6, 7, 8, 9, 10, -11, -12, -13, -14]  # [8, -50]
# list3 = [1]  # [1, 0]
# list4 = [-1]  # [0, -1]
# list5 = [0, 0, 0, 0, 0, 0, 0, 0, 0]  # [0, 0]
#
# x = y = 0
# for i in list5:
#     if i > 0:
#         x += 1
#     else:
#         y += i
# print([x, y])

'''
Возьмите массив и удалите каждый второй элемент из массива. Всегда сохраняйте первый элемент и начинайте удаление со следующего элемента. Попробуйте написать более одного решения задачи.
'''
list1 = ['Hello', 'Goodbye', 'Hello Again']  # ['Hello', 'Hello Again']
list2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]  # [1, 3, 5, 7, 9]
list3 = [[1, 2]]  # [[1, 2]]

# print([e for i, e in enumerate(list1) if not i % 2])
# print([e for i, e in enumerate(list2) if not i % 2])
# print([e for i, e in enumerate(list3) if not i % 2])

print(list1[::2])
print(list2[::2])
print(list3[::2])
